## 🏗️ Terraform Plan - `staging` Environment

### Workflow Status
| Step | Status |
|------|--------|
| 🖌️ Format | ⚠️ |
| ⚙️ Init | ✅ |
| ✅ Validate | ✅ |
| 📖 Plan | ✅ |
| 🔒 Security Scan | ✅ |

### Resource Changes
| Action | Count |
|--------|-------|
| 🟢 Create | 67 |
| 🟡 Update | 0 |
| 🔴 Delete | 0 |

<details>
<summary>📋 Show Full Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault_secret.mysql_admin_password will be created
  + resource "azurerm_key_vault_secret" "mysql_admin_password" {
      + content_type            = "password"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "mysql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.mysql_connection_string will be created
  + resource "azurerm_key_vault_secret" "mysql_connection_string" {
      + content_type            = "connection-string"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "mysql-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.acr.azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + anonymous_pull_enabled        = false
      + data_endpoint_enabled         = true
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westus2"
      + login_server                  = (known after apply)
      + name                          = "bankingstagingacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = [
          + {
              + default_action = "Deny"
            },
        ]
      + public_network_access_enabled = false
      + quarantine_policy_enabled     = false
      + resource_group_name           = "banking-staging-rg"
      + retention_policy              = [
          + {
              + days    = 30
              + enabled = true
            },
        ]
      + sku                           = "Premium"
      + tags                          = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + trust_policy                  = [
          + {
              + enabled = true
            },
        ]
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_monitor_diagnostic_setting.acr[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "acr" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "bankingstagingacr-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ContainerRegistryLoginEvents"
        }
      + enabled_log {
          + category = "ContainerRegistryRepositoryEvents"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.acr.azurerm_private_endpoint.acr[0] will be created
  + resource "azurerm_private_endpoint" "acr" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westus2"
      + name                     = "bankingstagingacr-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "banking-staging-rg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "bankingstagingacr-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "banking-staging"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32"
      + location                            = "westus2"
      + name                                = "banking-staging-aks"
      + node_resource_group                 = "banking-staging-aks-nodes-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = true
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "banking-staging-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workload_identity_enabled           = true

      + auto_scaler_profile {
          + balance_similar_node_groups      = true
          + empty_bulk_delete_max            = "10"
          + expander                         = "least-waste"
          + max_graceful_termination_sec     = "600"
          + max_node_provisioning_time       = "15m"
          + max_unready_nodes                = 3
          + max_unready_percentage           = 45
          + new_pod_scale_up_delay           = "10s"
          + scale_down_delay_after_add       = "10m"
          + scale_down_delay_after_delete    = "10s"
          + scale_down_delay_after_failure   = "3m"
          + scale_down_unneeded              = "10m"
          + scale_down_unready               = "20m"
          + scale_down_utilization_threshold = "0.5"
          + scan_interval                    = "10s"
          + skip_nodes_with_local_storage    = false
          + skip_nodes_with_system_pods      = true
        }

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 50
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = 2
          + node_labels                  = {
              + "environment"   = "staging"
              + "nodepool-type" = "system"
            }
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "CostCenter"  = "staging"
              + "Environment" = "staging"
              + "ManagedBy"   = "Terraform"
              + "Owner"       = "devops@company.com"
              + "Project"     = "banking"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D4s_v5"
          + vnet_subnet_id               = (known after apply)
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
              + "2",
            ]

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 0,
                  + 1,
                  + 2,
                  + 3,
                  + 4,
                  + 5,
                ]
            }
        }

      + microsoft_defender {
          + log_analytics_workspace_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip          = "10.100.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.100.0.0/16"
          + service_cidrs           = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = 30
              + managed_outbound_ip_count   = 1
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ports_allocated    = 0
            }
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.spot[0] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot" {
      + enable_auto_scaling   = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 50
      + min_count             = 0
      + mode                  = "User"
      + name                  = "spot"
      + node_count            = (known after apply)
      + node_labels           = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "nodepool-type"                         = "spot"
        }
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4s_v5"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
          + "2",
        ]

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.user will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "user" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 8
      + max_pods              = 50
      + min_count             = 2
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 2
      + node_labels           = {
          + "environment"   = "staging"
          + "nodepool-type" = "user"
          + "workload-type" = "general"
        }
      + node_taints           = []
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4s_v5"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
          + "2",
        ]

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-staging-aks-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "cluster-autoscaler"
        }
      + enabled_log {
          + category = "guard"
        }
      + enabled_log {
          + category = "kube-apiserver"
        }
      + enabled_log {
          + category = "kube-audit"
        }
      + enabled_log {
          + category = "kube-audit-admin"
        }
      + enabled_log {
          + category = "kube-controller-manager"
        }
      + enabled_log {
          + category = "kube-scheduler"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_role_assignment.aks_acr_pull[0] will be created
  + resource "azurerm_role_assignment" "aks_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_role_assignment.aks_network_contributor will be created
  + resource "azurerm_role_assignment" "aks_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_user_assigned_identity.aks will be created
  + resource "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "banking-staging-aks-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "banking-staging-rg"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + tenant_id           = (known after apply)
    }

  # module.keyvault.azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "westus2"
      + name                            = (known after apply)
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "banking-staging-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 30
      + tags                            = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + tenant_id                       = "fdc5ebae-7028-4044-bde5-e0dfd654368b"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.keyvault.azurerm_monitor_diagnostic_setting.keyvault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "keyvault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = (known after apply)
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
      + enabled_log {
          + category = "AzurePolicyEvaluationDetails"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.keyvault.azurerm_role_assignment.terraform_admin[0] will be created
  + resource "azurerm_role_assignment" "terraform_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9676d6b0-2054-4fde-823f-4d3be8e0a6ca"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.monitoring.azurerm_application_insights.main[0] will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 10
      + daily_data_cap_notifications_disabled = false
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westus2"
      + name                                  = "banking-staging-ai"
      + resource_group_name                   = "banking-staging-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workspace_id                          = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_solution.container_insights[0] will be created
  + resource "azurerm_log_analytics_solution" "container_insights" {
      + id                    = (known after apply)
      + location              = "westus2"
      + resource_group_name   = "banking-staging-rg"
      + solution_name         = "ContainerInsights"
      + workspace_name        = "banking-staging-law"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.monitoring.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "westus2"
      + name                            = "banking-staging-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "banking-staging-rg"
      + retention_in_days               = 60
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workspace_id                    = (known after apply)
    }

  # module.monitoring.azurerm_monitor_action_group.critical will be created
  + resource "azurerm_monitor_action_group" "critical" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-staging-critical-ag"
      + resource_group_name = "banking-staging-rg"
      + short_name          = "Critical"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.monitoring.azurerm_monitor_action_group.warning will be created
  + resource "azurerm_monitor_action_group" "warning" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-staging-warning-ag"
      + resource_group_name = "banking-staging-rg"
      + short_name          = "Warning"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.container_restarts[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "container_restarts" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when containers are restarting frequently"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "westus2"
      + name                                   = "banking-staging-container-restarts-alert"
      + resource_group_name                    = "banking-staging-rg"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                KubePodInventory
                | where TimeGenerated > ago(15m)
                | where PodRestartCount > 5
                | summarize RestartCount = sum(PodRestartCount) by Name, Namespace
                | where RestartCount > 10
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.error_logs[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "error_logs" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when there are many application errors"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "westus2"
      + name                                   = "banking-staging-error-logs-alert"
      + resource_group_name                    = "banking-staging-rg"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AppExceptions
                | where TimeGenerated > ago(15m)
                | summarize ErrorCount = count() by AppRoleName
                | where ErrorCount > 50
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.monitoring_alerts.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "westus2"
      + name                            = "banking-staging-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "banking-staging-rg"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workspace_id                    = (known after apply)
    }

  # module.monitoring_alerts.azurerm_monitor_action_group.critical will be created
  + resource "azurerm_monitor_action_group" "critical" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-staging-alerts-critical-ag"
      + resource_group_name = "banking-staging-rg"
      + short_name          = "Critical"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.monitoring_alerts.azurerm_monitor_action_group.warning will be created
  + resource "azurerm_monitor_action_group" "warning" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-staging-alerts-warning-ag"
      + resource_group_name = "banking-staging-rg"
      + short_name          = "Warning"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.monitoring_alerts.azurerm_monitor_metric_alert.aks_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "aks_cpu" {
      + auto_mitigate            = true
      + description              = "Alert when AKS CPU usage is high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "banking-staging-alerts-aks-cpu-alert"
      + resource_group_name      = "banking-staging-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "node_cpu_usage_percentage"
          + metric_namespace       = "Microsoft.ContainerService/managedClusters"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.monitoring_alerts.azurerm_monitor_metric_alert.aks_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "aks_memory" {
      + auto_mitigate            = true
      + description              = "Alert when AKS memory usage is high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "banking-staging-alerts-aks-memory-alert"
      + resource_group_name      = "banking-staging-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "node_memory_working_set_percentage"
          + metric_namespace       = "Microsoft.ContainerService/managedClusters"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 85
        }
    }

  # module.monitoring_alerts.azurerm_monitor_metric_alert.aks_node_not_ready[0] will be created
  + resource "azurerm_monitor_metric_alert" "aks_node_not_ready" {
      + auto_mitigate            = true
      + description              = "Alert when AKS nodes are not ready"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "banking-staging-alerts-aks-node-not-ready-alert"
      + resource_group_name      = "banking-staging-rg"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "kube_node_status_condition"
          + metric_namespace       = "Microsoft.ContainerService/managedClusters"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "status2"
              + operator = "Include"
              + values   = [
                  + "NotReady",
                ]
            }
        }
    }

  # module.monitoring_alerts.azurerm_monitor_metric_alert.mysql_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "mysql_cpu" {
      + auto_mitigate            = true
      + description              = "Alert when MySQL CPU usage is high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "banking-staging-alerts-mysql-cpu-alert"
      + resource_group_name      = "banking-staging-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforMySQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.monitoring_alerts.azurerm_monitor_metric_alert.mysql_storage[0] will be created
  + resource "azurerm_monitor_metric_alert" "mysql_storage" {
      + auto_mitigate            = true
      + description              = "Alert when MySQL storage is running low"
      + enabled                  = true
      + frequency                = "PT15M"
      + id                       = (known after apply)
      + name                     = "banking-staging-alerts-mysql-storage-alert"
      + resource_group_name      = "banking-staging-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT1H"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforMySQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.mysql.azurerm_monitor_diagnostic_setting.mysql[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "mysql" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-staging-mysql-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "MySqlAuditLogs"
        }
      + enabled_log {
          + category = "MySqlSlowLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.mysql.azurerm_mysql_flexible_database.main["bankingdb"] will be created
  + resource "azurerm_mysql_flexible_database" "main" {
      + charset             = "utf8mb4"
      + collation           = "utf8mb4_unicode_ci"
      + id                  = (known after apply)
      + name                = "bankingdb"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
    }

  # module.mysql.azurerm_mysql_flexible_server.main will be created
  + resource "azurerm_mysql_flexible_server" "main" {
      + administrator_login           = "mysqladmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 14
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westus2"
      + name                          = "banking-staging-mysql"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "banking-staging-rg"
      + sku_name                      = "B_Standard_B2s"
      + tags                          = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + version                       = "8.0.21"
      + zone                          = "3"

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 2
          + start_minute = 0
        }

      + storage {
          + auto_grow_enabled  = true
          + io_scaling_enabled = false
          + iops               = 360
          + size_gb            = 64
        }
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.audit_log[0] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "audit_log" {
      + id                  = (known after apply)
      + name                = "audit_log_enabled"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.audit_log_events[0] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "audit_log_events" {
      + id                  = (known after apply)
      + name                = "audit_log_events"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
      + value               = "CONNECTION,DDL,DML,DCL"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.log_queries_not_using_indexes will be created
  + resource "azurerm_mysql_flexible_server_configuration" "log_queries_not_using_indexes" {
      + id                  = (known after apply)
      + name                = "log_queries_not_using_indexes"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.long_query_time will be created
  + resource "azurerm_mysql_flexible_server_configuration" "long_query_time" {
      + id                  = (known after apply)
      + name                = "long_query_time"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
      + value               = "2"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.require_ssl will be created
  + resource "azurerm_mysql_flexible_server_configuration" "require_ssl" {
      + id                  = (known after apply)
      + name                = "require_secure_transport"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.slow_query_log will be created
  + resource "azurerm_mysql_flexible_server_configuration" "slow_query_log" {
      + id                  = (known after apply)
      + name                = "slow_query_log"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.tls_version will be created
  + resource "azurerm_mysql_flexible_server_configuration" "tls_version" {
      + id                  = (known after apply)
      + name                = "tls_version"
      + resource_group_name = "banking-staging-rg"
      + server_name         = "banking-staging-mysql"
      + value               = "TLSv1.2,TLSv1.3"
    }

  # module.mysql.random_password.admin will be created
  + resource "random_password" "admin" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.networking.azurerm_nat_gateway.main[0] will be created
  + resource "azurerm_nat_gateway" "main" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 10
      + location                = "westus2"
      + name                    = "banking-staging-nat-gateway"
      + resource_group_name     = "banking-staging-rg"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + zones                   = [
          + "1",
        ]
    }

  # module.networking.azurerm_nat_gateway_public_ip_association.main[0] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "main" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.networking.azurerm_network_security_group.aks will be created
  + resource "azurerm_network_security_group" "aks" {
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "banking-staging-aks-nsg"
      + resource_group_name = "banking-staging-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_network_security_group.database will be created
  + resource "azurerm_network_security_group" "database" {
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "banking-staging-db-nsg"
      + resource_group_name = "banking-staging-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_network_security_rule.aks_http_inbound will be created
  + resource "azurerm_network_security_rule" "aks_http_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPInbound"
      + network_security_group_name = "banking-staging-aks-nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.aks_https_inbound will be created
  + resource "azurerm_network_security_rule" "aks_https_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPSInbound"
      + network_security_group_name = "banking-staging-aks-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.db_deny_all will be created
  + resource "azurerm_network_security_rule" "db_deny_all" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "banking-staging-db-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.db_mysql will be created
  + resource "azurerm_network_security_rule" "db_mysql" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3306"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowMySQLFromAKS"
      + network_security_group_name = "banking-staging-db-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "10.1.0.0/22"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_private_dns_zone.acr will be created
  + resource "azurerm_private_dns_zone" "acr" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-staging-rg"
      + tags                                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_private_dns_zone.keyvault will be created
  + resource "azurerm_private_dns_zone" "keyvault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-staging-rg"
      + tags                                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_private_dns_zone.mysql will be created
  + resource "azurerm_private_dns_zone" "mysql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.mysql.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-staging-rg"
      + tags                                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.acr will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "acr" {
      + id                    = (known after apply)
      + name                  = "acr-vnet-link"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "banking-staging-rg"
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.keyvault will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "keyvault" {
      + id                    = (known after apply)
      + name                  = "keyvault-vnet-link"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "banking-staging-rg"
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.mysql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "mysql" {
      + id                    = (known after apply)
      + name                  = "mysql-vnet-link"
      + private_dns_zone_name = "privatelink.mysql.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "banking-staging-rg"
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_public_ip.nat[0] will be created
  + resource "azurerm_public_ip" "nat" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus2"
      + name                    = "banking-staging-nat-pip"
      + resource_group_name     = "banking-staging-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.networking.azurerm_subnet.aks will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                               = [
          + "10.1.0.0/22",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-staging-aks-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banki

... (truncated, see workflow logs for full output)
```

</details>

---
*Triggered by @boateng0303 | Workflow: `Terraform PR Validation` | [View Logs](https://github.com/boateng0303/secure-bankapp-devsecops/actions/runs/20648071597)*